[
  {
    "id": 3,
    "title": "V20 Summit & Conference 2025 - Cape Town",
    "shortDescription": "Join us for the prestigious V20 Valuation Summit and Conference in Cape Town, September 15-16, 2025.",
    "date": "2025-09-15",
    "icon": "calendar",
    "content": "V20 Summit & Conference 2025\n@Cape Town, South Africa\n15-16 September\n\nWe are excited to announce that the V20 Valuation Summit and Conference 2025 will be held in South Africa, following its successful editions in India in 2023 and Brazil in 2024.\n\nThis year's theme is: Valuation for Solidarity, Inclusion, and Sustainability: A Pathway to Global Harmony and Development.\n\nEvent Details:\n• Date: 15-16 September 2025\n• Venue: Cape Town International Convention Centre (CTICC), South Africa\n• Recommended Accommodation: Hotel Sky\n\nThis prestigious event will gather a large number of professionals, including valuation experts, corporate leaders, regulators, and decision-makers from across South Africa and abroad. The conference will offer engaging presentations, insightful discussions, and invaluable networking opportunities aimed at advancing the valuation profession and fostering collaboration.\n\nSponsorship Opportunities Available:\n• Platinum Sponsor: R250,000 ($15,000)\n• Gold Sponsor: R185,000 ($10,000)\n• Silver Sponsor: R95,000 ($5,000)\n• Bronze Sponsor: R50,000 ($2,500)\n\nSponsorship provides a unique opportunity to:\n• Demonstrate leadership in the valuation sector\n• Gain visibility among key stakeholders and industry influencers\n• Contribute to thought leadership and conference content\n• Boost brand exposure across our marketing platforms\n• Connect with a highly engaged professional audience\n\nContact Information:\nSAIV Head Office\nTel: 011 642 7266\nEmail: info@saiv.org.za\nWebsite: www.saiv.org.za",
    "bannerImage": "/v20summit.png",
    "pdfUrl": "/announcements/8022a2d1-08ce-4c97-995d-16ad6143042e.pdf",
    "webUrl": "https://saiv.glueup.com/view-in-browser/1454:389444:98cb604d-62a7-4ba8-b8bd-f50bd2fc8e50"
  },
  {
    "id": 1,
    "title": "Website Upgrade & New Registration System",
    "shortDescription": "Important information about the upcoming transition to e-Certificates and e-Registration cards.",
    "date": "2025-04-01",
    "icon": "bell",
    "content": "To: All Registered Persons, Interested and affected Stakeholders\n\nUPGRADING OF THE CURRENT WEBSITE AND TRANSITION TO A NEW REGISTRATION AND FINANCE SYSTEM.\n\nDear Registered Person (RP)\n\nCommencing today, you will be receiving a series of updates relating to the upgrading of the Website and the progress ito the development of the new Registration and Finance system.\n\nOur current system has been operational since 1980's so it is a historical transition and we can only imagine it is much to the delight of the RPs. The frustrations that many of you have experienced hopefully will be an event of the past.\n\nAs the incoming Registrar it has taken some time to assess the problem areas. A critical appraisal was indeed required and after analysing and evaluating the current system, there was no other choice but to transition from a very manual based operation to now a more systematised one.\n\nWe are therefore pleased to share an exciting update from our recent meeting with the service providers appointed.\n\nLater this year, we will transition from physical registration cards to modern, secure e-Certificates and e-Registration cards. This change will make your registration process more convenient, secure, and eco-friendly.\n\nWhat's Coming?\n\n• e-Certificate: A digital document (PDF) confirming your registration status, which you can download or share with clients and authorities.\n• e-Registration Card: A digital ID card accessible via a mobile app or web portal, ideal for quick verification.\n• Both will feature QR codes for instant authenticity checks and advanced security measures like encryption.\n\nWhy Are We Making This Change?\n• Convenience: Access your credentials anytime, anywhere, without the risk of losing a physical card.\n• Security: Digital credentials are harder to forge and easier to verify.\n• Sustainability: Eliminates paper and plastic use.\n• Global Standards: Aligns with worldwide trends in digital professional credentials.\n\nWhat About Your Current Registration?\n• For those RPs who have received your current physical registration card, it remains valid until the new system launches later this year.\n• For the majority who have paid for registration unlike previous years, you will not be receiving your physical card as usual.\n• Many valuation companies and government organisations have created access cards or proof of being a registered Valuer.\n• Going forward, we will notify you well in advance with details on how to access your e-Certificate and e-Registration card once the system is ready. We anticipate well before the year end.\n\nWhat is Next?\n• We are working on a secure online portal and mobile app for easy access to your credentials.\n• When the system is ready, you'll receive an email with login instructions and access details.\n• Guides and support will be available on our website, and our helpdesk will assist you.\n\nWhat about CPD functionality?\n• You will have the ability to update the CPD point/s submission for approval\n• Upload the CPD documentation\n• Recording of annual CPD activity\n• CPD audit reviews reminders\n\nWe are committed to making this transition smooth and will keep you updated.\n\nWill there be Online registration?\n• Online registration form process will be available to members based on their profile and document requirements per member type\n\nThere will be many more functionalities and exciting news to share in the months ahead.\n\nThank you for your support as we are moving toward a more efficient and secure registration process and service.\n\nKind Regards",
    "pdfUrl": "/announcements/website-upgrade-announcement.pdf"
  },
  {
    "id": 2,
    "title": "Practical Work-School 2025 Application",
    "shortDescription": "Application form and important information for the Practical Work-School taking place August 25-29, 2025.",
    "date": "2025-05-08",
    "icon": "calendar",
    "content": "IMPORTANT ANNOUNCEMENT\n\nAPPLICATION FORM FOR PRACTICAL WORK-SCHOOL: 2025\n\n1. Personal Information\n\nSurname:\nName(s):\nReg. No.:\nReg. Category:\nContact No.:\nEmail:\n\n2. Who should attend the Work-school?\n\n* A Candidate Valuer (including a Candidate Single Residential Property Assessor) in his/her final year of study for an accredited valuation qualification and will be graduating in 2026.\n* A Candidate Valuer who has completed his/her accredited property valuation qualification and wish to apply for the admission examination.\n* All registered professionals (Professional Associated and Professional valuers) who would like to attend and acquire CPD (Continuing Professional Development) points; and\n* any other non-registered person.\n\n3. Work-school Package: 25 - 29 August 2025\n\n- Non-Registered person: R9,200.00\n- 5 days Registered person: R8,500.00\n- 1 day (R2,000.00) CPD or Refresher (must have attended the work-school before)\n\n4. Candidate Single Residential Property Assessors (CSRPA)\n\n- 3 days = R4,500.00\n\n5. Banking Details\n\nBank: ABSA\nBank Acc Number: 214 0285 741\nType: Current Account\nBranch: Menlyn - 632005\n\nPLEASE NOTE AS FOLLOWS:\n\n1. Use your registration number as reference or name and surname for those that are not registered with the Council\n2. Kindly send this registration form and proof of payment to Ms. LB Monyela at lerato@sacpvp.co.za or Mr. P Ntsweng at admin@sacpvp.co.za on or before 31 July 2025.\n3. Only those persons who have paid will be ensured of a reserved booking for the work school.",
    "pdfUrl": "/announcements/SACPVP Practical Workschool Reg form_2025.pdf"
  }
]
