[
  {
    "id": 14,
    "title": "Important Notice: Temporary Service Impact",
    "shortDescription": "SACPVP has encountered an unforeseen challenge that may temporarily impact response times. Alternative arrangements are being implemented.",
    "date": "2025-10-10",
    "icon": "bell",
    "important": "true",
    "content": "Dear Registered Persons\n\nPlease be advised that the South African Council for the Property Valuers Profession (SACPVP) has encountered an unforeseen challenge, which may temporarily impact our response time to correspondence and service requests.\n\nPlease be assured that SACPVP is actively implementing alternative arrangements to address this matter and minimise any inconvenience. We remain committed to maintaining the standard of service expected by our registered persons and will keep you informed of progress in resolving the situation.\n\nWe sincerely apologise for any inconvenience this may cause and appreciate your patience and understanding during this period.",
    "pdfUrl": "/announcements/ANNOUNCEMENT_SACPVP.pdf"
  },
  {
    "id": 1,
    "title": "2025 PRACTICAL WORKSCHOOL DIRECTION",
    "shortDescription": "Detailed directions and travel information for the 2025 Practical Workschool venue at Kopanong Hotel.",
    "date": "2025-01-15",
    "icon": "calendar",
    "bannerImage": "/announcements/map_directions.png",
    "important": "false",
    "content": "Please find below the detailed directions to the 2025 Practical Workschool venue at Kopanong Hotel. We recommend reviewing these directions before your departure to ensure timely arrival.\n\nFrom Pretoria:\nTake the R21 (South) Highway towards OR Tambo International Airport, take the Benoni off-ramp, turn left at the top of the off-ramp, follow the road to the traffic light, at The Engen garage turn left onto the M32, go through three sets of traffic lights and a stop sign. At the stop sign keep straight, drive ± 400 meters and turn right at the next traffic light into Glen Gory Road. After turning right, drive approximately 400 meters and Kopanong Hotel is located on the left hand side.\n\nFrom Johannesburg:\nTake the most convenient route towards OR Tambo International Airport (R24 Highway), then follow the R21 (North) Highway towards Pretoria, pass Kempton Park & Atlas off-ramps and take the third off-ramp after the Airport, being Pomona. Turn right at the top of the off-ramp at the traffic light, follow the M32 for 8.5km, (you will go through four sets of traffic lights and a stop sign. At the stop sign keep straight, drive ± 400 meters and turn right at the next traffic light into Glen Gory Road. After turning right, drive approximately 400 meters and Kopanong Hotel is located on the left hand side.\n\nN12 East:\nTake the N12 to Benoni, pass the East Rand Mall Shopping Centre, and pass the Atlas Road Off-ramp and take the next off-ramp, Tom Jones. Turn left at the traffic light (you are now in Bunyan Road which becomes the Great North Road). Proceed with the Great North Road (3km), at the 7th traffic light (this includes one pedestrian light), turn right into Oak Street. Go through two 4-way stops and pass the Oakfield's Pick'n Pay Shopping Centre on your right hand side. Keep travelling straight on Oak Street, the road name changes to Benoni Road, which becomes Glen Gory Road. From the traffic light at the BP Station, Kopanong Hotel is 4km down the road on your right.\n\nFor any queries regarding directions or the venue, please contact the SAIV office.",
    "pdfUrl": "/announcements/Map Directions.pdf"
  },
  {
    "id": 2,
    "title": "V20 Summit & Conference 2025",
    "shortDescription": "Join us for the prestigious V20 Valuation Summit and Conference 2025 in Cape Town, South Africa.",
    "date": "2025-01-01",
    "icon": "calendar",
    "bannerImage": "/v20summit.png",
    "important": "false",
    "content": "We are excited to announce that the V20 Valuation Summit and Conference 2025 will be held in South Africa, following its successful editions in India in 2023 and Brazil in 2024.\n\nThis year's theme is 'Valuation for Solidarity, Inclusion, and Sustainability: A Pathway to Global Harmony and Development.'\n\nEvent Details:\n- Date: 15-16 September 2025\n- Venue: Cape Town International Convention Centre (CTICC), South Africa\n- Recommended Accommodation: Hotel Sky\n\nThis prestigious event will gather a large number of professionals, including valuation experts, corporate leaders, regulators, and decision-makers from across South Africa and abroad. The conference will offer engaging presentations, insightful discussions, and invaluable networking opportunities aimed at advancing the valuation profession and fostering collaboration.\n\nSponsorship Categories:\n- Platinum: R250,000 ($15,000)\n- Gold: R185,000 ($10,000)\n- Silver: R95,000 ($5,000)\n- Bronze: R50,000 ($2,500)\n\nFor more information, please contact SAIV Head Office:\nTel: 011 642 7266\nEmail: info@saiv.org.za",
    "pdfUrl": "/announcements/v20-summit-conference-2025.pdf",
    "webUrl": "https://saiv.glueup.com/view-in-browser/1454:389444:98cb604d-62a7-4ba8-b8bd-f50bd2fc8e50"
  },
  {
    "id": 3,
    "title": "2025-2026 Examination Information",
    "shortDescription": "Important information regarding the upcoming professional examinations for the 2025-2026 academic year.",
    "date": "2024-12-10",
    "icon": "calendar",
    "important": "false",
    "content": "The South African Institute of Valuers is pleased to announce the examination schedule for the 2025-2026 academic year.\n\nExamination Details:\n- Registration opens: January 15, 2025\n- Registration closes: March 31, 2025\n- Examination dates: June 2025 and November 2025\n- Results release: Within 8 weeks of examination\n\nCandidates are advised to review the examination guidelines and ensure all prerequisites are met before registration. Study materials and preparation courses will be available through our approved education providers.",
    "pdfUrl": "/EXAMINATION INFO_2025_2026_2.pdf"
  },
  {
    "id": 4,
    "title": "Practical Work-School 2025 Application",
    "shortDescription": "Application form and important information for the Practical Work-School taking place August 25-29, 2025.",
    "date": "2025-05-08",
    "icon": "calendar",
    "important": "false",
    "content": "IMPORTANT ANNOUNCEMENT\n\nAPPLICATION FORM FOR PRACTICAL WORK-SCHOOL: 2025\n\n1. Personal Information\n\nSurname:\nName(s):\nReg. No.:\nReg. Category:\nContact No.:\nEmail:\n\n2. Who should attend the Work-school?\n\n* A Candidate Valuer (including a Candidate Single Residential Property Assessor) in his/her final year of study for an accredited valuation qualification and will be graduating in 2026.\n* A Candidate Valuer who has completed his/her accredited property valuation qualification and wish to apply for the admission examination.\n* All registered professionals (Professional Associated and Professional valuers) who would like to attend and acquire CPD (Continuing Professional Development) points; and\n* any other non-registered person.\n\n3. Work-school Package: 25 - 29 August 2025\n\n- Non-Registered person: R9,200.00\n- 5 days Registered person: R8,500.00\n- 1 day (R2,000.00) CPD or Refresher (must have attended the work-school before)\n\n4. Candidate Single Residential Property Assessors (CSRPA)\n\n- 3 days = R4,500.00\n\n5. Banking Details\n\nBank: ABSA\nBank Acc Number: 214 0285 741\nType: Current Account\nBranch: Menlyn - 632005\n\nPLEASE NOTE AS FOLLOWS:\n\n1. Use your registration number as reference or name and surname for those that are not registered with the Council\n2. Kindly send this registration form and proof of payment to Ms. LB Monyela at lerato@sacpvp.co.za or Mr. P Ntsweng at admin@sacpvp.co.za on or before 31 July 2025.\n3. Only those persons who have paid will be ensured of a reserved booking for the work school.",
    "pdfUrl": "/announcements/SACPVP Practical Workschool Reg form_2025.pdf"
  },
  {
    "id": 5,
    "title": "Website Upgrade Announcement",
    "shortDescription": "We are pleased to announce the launch of our upgraded website with enhanced features and improved user experience.",
    "date": "2024-12-15",
    "icon": "bell",
    "important": "false",
    "content": "We are excited to announce the launch of our upgraded website! Our new platform features improved navigation, enhanced search functionality, and a more user-friendly interface.\n\nKey improvements include:\n- Faster loading times\n- Mobile-responsive design\n- Enhanced member search capabilities\n- Streamlined registration processes\n- Improved accessibility features\n\nWe encourage all members to explore the new features and provide feedback to help us continue improving your experience.",
    "pdfUrl": "/announcements/website-upgrade-announcement.pdf"
  },
  {
    "id": 6,
    "title": "Executive Assistant Vacancy at BONITU HCC",
    "shortDescription": "BONITU HCC is recruiting an Executive Assistant to the Registrar. Apply by 15 August 2025.",
    "date": "2025-07-24",
    "icon": "briefcase",
    "important": "false",
    "content": "BONITU HCC is currently hiring for the position of Executive Assistant (EA) to the Registrar. This role provides high-level administrative and personal support, including schedule management, meeting coordination, and efficient day-to-day operations. Ideal candidates are organized, proactive, and capable of handling sensitive information with discretion.\n\nClosing date: 15 August 2025\n\nTo apply: Send your CV and portfolio to Recruitment@bonituhcc.co.za\n\nMinimum Requirements:\n- Diploma or degree in Business Administration or related field\n- 2 to 5 years of relevant experience\n- Strong MS Office proficiency\n- Excellent communication and time-management skills\n\n",
    "pdfUrl": "/EXECUTIVE ASSISTANT TO THE REGISTRAR.pdf"
  },
  {
    "id": 7,
    "title": "External Vacancy: Manager – Valuations (Alfred Duma Local Municipality)",
    "shortDescription": "The Alfred Duma Local Municipality invites applications for the position of Manager: Valuations. Applications close on 08 August 2025.",
    "date": "2025-07-24",
    "icon": "briefcase",
    "important": "true",
    "content": "The Alfred Duma Local Municipality has issued External Notice No. 58 of 2025 for the position of Manager: Valuations in the Budget and Treasury Department. This position is open to qualified professionals registered with the South African Council for the Property Valuers Profession (SACPVP).\n\nPosition: Manager: Valuations\nLocation: Ladysmith, KwaZulu-Natal\nSalary: R796,628.17 – R1,034,083.85 per annum (Task Grade 17)\n\nMinimum Requirements:\n- National Diploma (NQF Level 6) or Degree (NQF Level 7) in Property Valuation or relevant equivalent\n- Registered as a Professional Valuer or Professional Associated Valuer (no restrictions)\n- 5 years' experience in municipal valuations\n- Valid Code B or EB Driver’s License\n- Strong knowledge of the Municipal Property Rates Act\n\nKey Responsibilities:\n- Compilation and maintenance of General and Supplementary Valuation Rolls\n- Property inspections and market valuations for municipal purposes\n- Attend to valuation objections and appeals\n- Support in managing the municipal fixed asset register\n\nClosing Date: 08 August 2025, 16:00\n\nFor full application details, visit the SACPVP job posts page below.",
    "goToPage": {
      "label": "View on job posts",
      "url": "/job-posts/"
    }
  },
  {
    "id": 9,
    "title": "Announcement of New SACPVP Council Members",
    "shortDescription": "Two new members appointed to the 6th Council of the SACPVP following recent resignations.",
    "date": "2025-07-24",
    "icon": "briefcase",
    "important": "false",
    "content": "Following the resignation of two members from the 6th Council of the South African Council for the Property Valuers Profession (SACPVP), the Honourable Minister Mr. D Macpherson has appointed two new Council members.\n\nThese appointments are effective immediately and will remain in place until September 2026.\n\nThe updated 6th Council now includes:\n- Mr. John Frederick Cloete (President)\n- Ms. Tiny Dlamini (Vice President)\n- Ms. Mankuroane Matseba\n- Mr. Manyane Chidi\n- Ms. Rehab Letsaba\n- Ms. Hendrina Viljoen\n- Mr. Gregory Cowden\n- Mr. Rakesh Ramlugaan\n- Mr. JF du Toit (Saul)\n- Mr. MPL Mthuli (Malusi)\n\nThe announcement also includes the appointment of new administrative staff to strengthen Council operations.",
    "pdfUrl": "/announcements/ANNOUNCEMENT_NEW CLLRS_SACPVP BOARD.pdf"
  },
  {
    "id": 10,
    "title": "September 2025 Board Examination Rescheduled",
    "shortDescription": "The September Board Exam has been rescheduled to 25 September 2025. Applicable only to registered persons who applied.",
    "date": "2025-08-15",
    "icon": "calendar",
    "important": "false",
    "content": "To All Registered Ca Val & Pr Aval\n\nThe September Board examination has been re-scheduled to 25th September 2025 due to several requests from Registered Persons attending the V20 Summit and Conference, 2 days prior in Cape Town. (i.e. on the 15th and 16th).\n\nThe assessment of the applications to write the Board examination will be completed before the end of next week and the outcomes will be communicated thereafter.\n\nWe would like to apologise for the delay of releasing the outcome of your application to write the Board Exam.\n\nPlease note: This message is meant only for the Registered persons who have applied to write the Board Exam on 25 September 2025."
  },
  {
    "id": 11,
    "title": "SACPVP 2025 Practical Work-School — Final Programme",
    "shortDescription": "The confirmed final 5-day programme for the 2025 Practical Work-School at Kopanong Hotel, 25–29 August 2025.",
    "date": "2025-08-19",
    "icon": "calendar",
    "important": "true",
    "content": "Venue: Kopanong Hotel & Conference Centre, Benoni\n\nDAY 1 — Mon 25 Aug\n07:45 Registration & Refreshments — SACPVP Admin\n08:30 Official Opening — President John Cloete\n08:45 Overview of International Valuation Standards (IVS) — John Cloete\n10:15 Role of Regulatory Body; Professionalism & Exam Rules — Registrar\n10:45 Legislative Framework; Code of Conduct & Ethics — Gabriel Mashishi\n11:30–15:45 Financial & academic valuation concepts; Time Value of Money (TVM) — Maarten van Doesburgh (with lunch & breaks)\n17:00 End of Day One\n\nDAY 2 — Tue 26 Aug\n07:45 Registration — Admin\n08:30 Discounted Cash Flow (DCF) & Capital Budgeting — Maarten van Doesburgh\n09:30 TVM Revision — All Delegates\n10:30 TVM Test — All Delegates\n12:00 Valuation of Petrol Filling Stations (Practical) — Dr Nosipho Moloi\n14:15 Statutory Valuations — Cllr Tiny Dlamini\n15:30 Practical Session & Presentations — SAIV, BPVA & Mentors; Demos on value attributes, floor area measurement, town planning, building components; Registration briefing — Admin\n18:30 End of Day Two\n\nDAY 3 — Wed 27 Aug\n07:45 Registration — Admin\n08:30 The Role of the Valuer in the Economy — Patrick O’Connell\n10:00 MPRA & Municipal Rating; Standards Development + Q&A — Cllr Rakesh Ramlugaan & Dr Janet Channing\n11:30 Meeting with Team Leaders — Registered Valuers\n13:00 Site Visit: Practical Valuation — Isando Industrial Park, Gauteng\n17:00 End of Day Three\n\nDAY 4 — Thu 28 Aug\n07:45 Registration — Admin\n08:30 Investment Analysis — Marno Booyens\n11:00 The Role of AI in Revolutionising Valuations — Sean Godoy\n14:00 Practical Valuation Discussion: Commercial/Industrial Property — President John Cloete & Cllr M. Chidi\n15:45 Group Assignment: Instruction & Discussion — President John Cloete\n17:00 End of Day Four\n\nDAY 5 — Fri 29 Aug\n07:45 Registration — Admin\n08:30 Recap & Revision — Presenters\n10:00 Final Test (90 minutes) — All Attendees\n11:45 Certificates, Photographs & Closure — President, Vice President, Councillors & Admin\nLunch & Departure",
    "pdfUrl": "/announcements/SACPVP 2025 PWS_ PROGRAMME_Final_NEW.pdf"
  },
  {
    "id": 12,
    "title": "Board Examination Venue Form – 25 September 2025",
    "shortDescription": "Details and requirements for the SACPVP Board Examination taking place on 25 September 2025, including fees, venues, and submission deadlines.",
    "date": "2025-09-25",
    "icon": "calendar",
    "important": "false",
    "content": "The South African Council for the Property Valuers Profession (SACPVP) will host the Board Examination on 25 September 2025. All delegates intending to write must complete and return the Board Examination Venue Form with proof of payment to admin@sacpvp.co.za before 25 September 2025. Payment of the examination fees is mandatory before candidates will be allowed to write.\n\nExamination Fees:\n- Professional Associated Valuer (Pr AVal): R3 700.00\n- Single Residential Property Assessor (SRPA): R3 700.00\n- Professional Valuer (Pr Val): R4 000.00\n\nAvailable Venues:\n- Cape Town\n- Durban\n- Port Elizabeth\n- Pretoria\n\nBanking Details:\n- Bank: ABSA Bank\n- Account No: 21 4028 5741\n- Account Type: Cheque account\n- Branch: Menlyn, 335 645\n\nPlease use your surname and registration number as reference when making payment.",
    "pdfUrl": "/announcements/Exam Venue Form - 25 SEPTEMBER 2025.pdf"
  },
  {
    "id": 13,
    "title": "Pre-Exam Workshop Programme – 16&17 September 2025",
    "shortDescription": "The official programme for the Pre-Exam Workshop taking place on 16–17 September 2025 in Pretoria.",
    "date": "2025-09-01",
    "icon": "calendar",
    "important": "true",
    "content": "The South African Council for the Property Valuers Profession (SACPVP) invites all eligible candidates to attend the Pre-Exam Workshop in preparation for the upcoming Board Examination.\n\n📍 Venue: 158 Stella Street, Waterkloof, Pretoria\n🗓 Dates: 16 & 17 September 2025\n\nDay One (16 September 2025):\n- 09:00 – 09:30: Arrival & Registration\n- 09:30 – 10:00: Introduction (Registrar & Registration Team)\n- 10:00 – 10:30: Tea Break\n- 10:30 – 13:00: Time Value of Money — Mr. Maarten van Doesburgh\n- 13:00 – 13:45: Lunch Break\n- 13:45 – 16:30: Time Value of Money Q&A — Mr. Maarten van Doesburgh\n\nDay Two (17 September 2025):\n- 09:00 – 09:30: Arrival & Registration\n- 09:30 – 10:30: Time Value of Money — Mr. Maarten van Doesburgh\n- 10:30 – 11:00: Tea Break\n- 11:00 – 12:00: General Board Examination Scope — Mr. Maarten van Doesburgh\n- 12:00 – 13:30: Municipal Property Rates Act (as amended) & General Topics\n- 13:30: Lunch & Departure\n\nAttendance of this workshop is strongly recommended for all candidates preparing to write the September Board Examination.",
    "pdfUrl": "/examinations/Pre-Exam Workshop Programme - 16  17 September 2025.pdf"
  }
]
