[
  {
    "id": 14,
    "title": "Important Notice: Temporary Service Impact",
    "shortDescription": "SACPVP has encountered an unforeseen challenge that may temporarily impact response times. Alternative arrangements are being implemented.",
    "date": "2025-10-10",
    "icon": "bell",
    "important": "true",
    "content": "Dear Registered Persons\n\nPlease be advised that the South African Council for the Property Valuers Profession (SACPVP) has encountered an unforeseen challenge, which may temporarily impact our response time to correspondence and service requests.\n\nPlease be assured that SACPVP is actively implementing alternative arrangements to address this matter and minimise any inconvenience. We remain committed to maintaining the standard of service expected by our registered persons and will keep you informed of progress in resolving the situation.\n\nWe sincerely apologise for any inconvenience this may cause and appreciate your patience and understanding during this period.",
    "pdfUrl": "/announcements/ANNOUNCEMENT_SACPVP.pdf"
  },
  {
    "id": 3,
    "title": "2025-2026 Examination Information",
    "shortDescription": "Important information regarding the upcoming professional examinations for the 2025-2026 academic year.",
    "date": "2024-12-10",
    "icon": "calendar",
    "important": "false",
    "content": "The South African Institute of Valuers is pleased to announce the examination schedule for the 2025-2026 academic year.\n\nExamination Details:\n- Registration opens: January 15, 2025\n- Registration closes: March 31, 2025\n- Examination dates: June 2025 and November 2025\n- Results release: Within 8 weeks of examination\n\nCandidates are advised to review the examination guidelines and ensure all prerequisites are met before registration. Study materials and preparation courses will be available through our approved education providers.",
    "pdfUrl": "/EXAMINATION INFO_2025_2026_2.pdf"
  },
  {
    "id": 5,
    "title": "Website Upgrade Announcement",
    "shortDescription": "We are pleased to announce the launch of our upgraded website with enhanced features and improved user experience.",
    "date": "2024-12-15",
    "icon": "bell",
    "important": "false",
    "content": "We are excited to announce the launch of our upgraded website! Our new platform features improved navigation, enhanced search functionality, and a more user-friendly interface.\n\nKey improvements include:\n- Faster loading times\n- Mobile-responsive design\n- Enhanced member search capabilities\n- Streamlined registration processes\n- Improved accessibility features\n\nWe encourage all members to explore the new features and provide feedback to help us continue improving your experience.",
    "pdfUrl": "/announcements/website-upgrade-announcement.pdf"
  },
  {
    "id": 7,
    "title": "External Vacancy: Manager – Valuations (Alfred Duma Local Municipality)",
    "shortDescription": "The Alfred Duma Local Municipality invites applications for the position of Manager: Valuations. Applications close on 08 August 2025.",
    "date": "2025-07-24",
    "icon": "briefcase",
    "important": "true",
    "content": "The Alfred Duma Local Municipality has issued External Notice No. 58 of 2025 for the position of Manager: Valuations in the Budget and Treasury Department. This position is open to qualified professionals registered with the South African Council for the Property Valuers Profession (SACPVP).\n\nPosition: Manager: Valuations\nLocation: Ladysmith, KwaZulu-Natal\nSalary: R796,628.17 – R1,034,083.85 per annum (Task Grade 17)\n\nMinimum Requirements:\n- National Diploma (NQF Level 6) or Degree (NQF Level 7) in Property Valuation or relevant equivalent\n- Registered as a Professional Valuer or Professional Associated Valuer (no restrictions)\n- 5 years' experience in municipal valuations\n- Valid Code B or EB Driver’s License\n- Strong knowledge of the Municipal Property Rates Act\n\nKey Responsibilities:\n- Compilation and maintenance of General and Supplementary Valuation Rolls\n- Property inspections and market valuations for municipal purposes\n- Attend to valuation objections and appeals\n- Support in managing the municipal fixed asset register\n\nClosing Date: 08 August 2025, 16:00\n\nFor full application details, visit the SACPVP job posts page below.",
    "goToPage": {
      "label": "View on job posts",
      "url": "/job-posts/"
    }
  },
  {
    "id": 9,
    "title": "Announcement of New SACPVP Council Members",
    "shortDescription": "Two new members appointed to the 6th Council of the SACPVP following recent resignations.",
    "date": "2025-07-24",
    "icon": "briefcase",
    "important": "false",
    "content": "Following the resignation of two members from the 6th Council of the South African Council for the Property Valuers Profession (SACPVP), the Honourable Minister Mr. D Macpherson has appointed two new Council members.\n\nThese appointments are effective immediately and will remain in place until September 2026.\n\nThe updated 6th Council now includes:\n- Mr. John Frederick Cloete (President)\n- Ms. Tiny Dlamini (Vice President)\n- Ms. Mankuroane Matseba\n- Mr. Manyane Chidi\n- Ms. Rehab Letsaba\n- Ms. Hendrina Viljoen\n- Mr. Gregory Cowden\n- Mr. Rakesh Ramlugaan\n- Mr. JF du Toit (Saul)\n- Mr. MPL Mthuli (Malusi)\n\nThe announcement also includes the appointment of new administrative staff to strengthen Council operations.",
    "pdfUrl": "/announcements/ANNOUNCEMENT_NEW CLLRS_SACPVP BOARD.pdf"
  },
  {
    "id": 10,
    "title": "Board Examination Notice – March 2026",
    "shortDescription": "Applications open for the 19 March 2026 Board Examination. Closing date: 05 December 2025. Courier/hand-delivery only.",
    "date": "2025-10-03",
    "icon": "clipboard-list",
    "important": "true",
    "content": "The SACPVP is accepting Board exam applications for 19 March 2026. Submit by courier or hand delivery to Mr. Ntsweng; email submissions are NOT accepted. Closing date: 05 December 2025.\n\nWho can apply:\n- Registered Candidate Valuers (≥2 years) with accredited Real Estate qualification\n- Registered Professional Associated Valuers\n- Pr AVals may apply for Pr Val admission exam if they meet degree and tenure requirements\n\nApplication pack includes:\n- Completed application (incl. Experience Matrix + supporting docs)\n- Certified qualifications + transcripts (≤3 months old)\n- Certified ID/passport + valid work permit (if applicable)\n- Detailed CV\n- Supervisor/mentor letter (with SACPVP reg no. + postal address)\n- Practical Workschool certificate (compulsory)\n\nNotes:\n- Prior unsuccessful candidates and previously approved but unable-to-write candidates should NOT submit new applications—email confirmation before the closing date suffices.\n- Exam will be held in a physical/contact session.\n\nFees (VAT incl.; 50% refundable until 14 days before Exam):\n- Pr AVal exam: R3,700.00\n- Pr AVal writing Pr Val exam: R4,000.00\n(Payment requested once application is approved.)",
    "pdfUrl": "/announcements/BOARD EXAM NOTICE_MARCH 2026.pdf"
  },
  {
    "id": 11,
    "title": "Board Examination Rules – March 2026",
    "shortDescription": "Three-hour contact exam. Laptops (blank spreadsheets) and financial calculators allowed. Pass mark 60% with TVM sub-minimum 40%.",
    "date": "2025-10-03",
    "icon": "file-text",
    "important": "true",
    "content": "Key rules:\n- Duration: 3 hours; complete on supplied paper only.\n- Devices: Financial calculator and laptop allowed for blank spreadsheet (no internet/apps). Email spreadsheet before leaving the venue to registrar@sacpvp.co.za and vandoesburghm@cput.ac.za.\n- Sequence: Hand in Sections A & B before opening the laptop for spreadsheets; no return to A & B thereafter.\n- Pass requirements: Overall 60% with a 40% sub-minimum for Time Value of Money (TVM).\n- Conduct: No speaking, cheating, or external materials. No eating/drinking. Phones prohibited. Invigilator decisions are final; irregularities may cancel the exam.\n- Admin: No removing papers from venue. Scripts received late won’t be marked. Include registration number in spreadsheet/file/email subject.\n- Script viewing: Pay within 5 working days of results; viewing within 7 days. No viewing for Supplementary exams.",
    "pdfUrl": "/announcements/BOARD EXAMINATION RULES_MARCH 2026.pdf"
  },
  {
    "id": 12,
    "title": "Board Examination Venues – 19 March 2026",
    "shortDescription": "Venue list for Durban, Pretoria, Cape Town, East London, and Port Elizabeth (subject to change; advance notice will be given).",
    "date": "2025-10-31",
    "icon": "map-pin",
    "important": "false",
    "content": "Scheduled contact venues for 19 March 2026 (subject to change):\n- Durban: Embassy Building, 15th Floor, 199 Anton Lembede St (Smith)\n- Pretoria: NG Kerk, 158 Stella Street, Waterkloof, 0181\n- Cape Town: CPUT, Real Estate Dept (Unit of Applied Economics), Room E3.39, Engineering Building, c/o Keizergracht & Tennant St, Zonnebloem, 8001\n- East London: 1 Cavendish Road, Vincent (Second Office opposite Tiger Wheel & Tyre and Vincent Hardware)\n- Port Elizabeth (Gqeberha): Beach Hotel Banqueting, Marine Drive, Summerstrand, 6000",
    "pdfUrl": "/announcements/BOARD EXAMINATION VENUES_VARIOUS_MARCH 2026.pdf"
  }
]
